БИТУправление_медицинским_центром_демо/src/Enums/ТипыСкладов/ТипыСкладов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСкладов</name>
  <enumValues>
    <name>Аптека</name>
  </enumValues>
  <enumValues>
    <name>Отделение</name>
  </enumValues>
  <enumValues>
    <name>РозничныйМагазин</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Enums/ТипыСкладов/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Перечисления.ТипыСкладов.Аптека);
	ДанныеВыбора.Добавить(Перечисления.ТипыСкладов.Отделение);	
	ДанныеВыбора.Добавить(Перечисления.ТипыСкладов.РозничныйМагазин);

	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС
#Область ПрограммныйИнтерфейс

// Возвращает типы складов соответствующие складам основного учета
//
Функция ТипыСкладовАптеки() Экспорт
	
	ТипыСкладов = Новый Массив;
	ТипыСкладов.Добавить(Перечисления.ТипыСкладов.Аптека);
	ТипыСкладов.Добавить(Перечисления.ТипыСкладов.РозничныйМагазин);
	
	Возврат ТипыСкладов;
	
КонецФункции

// Возвращает типы складов соответствующие складам, которые могут отпускать товар в отделения
//
Функция ТипыСкладовВзаимодействующиеСОтделениями() Экспорт
	
	ТипыСкладов = Новый Массив;
	ТипыСкладов.Добавить(Перечисления.ТипыСкладов.Аптека);
	
	Возврат ТипыСкладов;
	
КонецФункции

// Возвращает типы складов соответствующие складам, на которых могут выполнятся производственные операции
//
Функция ТипыСкладовПроизводства() Экспорт
	
	ТипыСкладов = Новый Массив;
	ТипыСкладов.Добавить(Перечисления.ТипыСкладов.Аптека);
	
	Возврат ТипыСкладов;
	
КонецФункции

// Возвращает типы складов соответствующие складам отделений
//
Функция ТипыСкладовОтделений() Экспорт
	
	ТипыСкладов = Новый Массив;
	ТипыСкладов.Добавить(Перечисления.ТипыСкладов.Отделение);
	
	Возврат ТипыСкладов;
	
КонецФункции

// Возвращает типы складов соответствующие розничным магазинам
//
Функция ТипыРозничныхСкладов() Экспорт
	
	ТипыСкладов = Новый Массив;
	ТипыСкладов.Добавить(Перечисления.ТипыСкладов.РозничныйМагазин);
	
	Возврат ТипыСкладов;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#КонецЕсли
